SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_iadc.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 IADC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_IADC_H
#define EFR32SG28_IADC_H

#define IADC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_IADC IADC
 * @{
 * @brief EFR32SG28 IADC Register Declaration.
 *****************************************************************************/

/** IADC CFG Register Group Declaration. */
typedef struct
{
  __IOM uint32_t             CFG;                    /**< Configuration                                      */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             SCALE;                  /**< Scaling                                            */
  __IOM uint32_t             SCHED;                  /**< Scheduling                                         */
} IADC_CFG_TypeDef;


/** IADC SCANTABLE Register Group Declaration. */
typedef struct
{
  __IOM uint32_t             SCAN;                   /**< SCAN Entry                                         */
} IADC_SCANTABLE_TypeDef;


/** IADC Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IPVERSION                                          */
  __IOM uint32_t             EN;                     /**< Enable                                             */
  __IOM uint32_t             CTRL;                   /**< Control                                            */
  __IOM uint32_t             CMD;                    /**< Command                                            */
  __IOM uint32_t             TIMER;                  /**< Timer                                              */
  __IM  uint32_t             STATUS;                 /**< Status                                             */
  __IOM uint32_t             MASKREQ;                /**< Mask Request                                       */
  __IM  uint32_t             STMASK;                 /**< Scan Table Mask                                    */
  __IOM uint32_t             CMPTHR;                 /**< Digital Window Comparator Threshold                */
  __IOM uint32_t             IF;                     /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable                                   */
  __IOM uint32_t             TRIGGER;                /**< Trigger                                            */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED1[5U];     /**< Reserved for future use                            */
        IADC_CFG_TypeDef     CFG[2U];           /**< CFG                                                */
        uint32_t             RESERVED2[2U];     /**< Reserved for future use                            */
  __IOM uint32_t             SINGLEFIFOCFG;          /**< Single FIFO Configuration                          */
  __IM  uint32_t             SINGLEFIFODATA;         /**< Single FIFO DATA                                   */
  __IM  uint32_t             SINGLEFIFOSTAT;         /**< Single FIFO Status                                 */
  __IM  uint32_t             SINGLEDATA;             /**< Single Data                                        */
  __IOM uint32_t             SCANFIFOCFG;            /**< Scan FIFO Configuration                            */
  __IM  uint32_t             SCANFIFODATA;           /**< Scan FIFO Read Data                                */
  __IM  uint32_t             SCANFIFOSTAT;           /**< Scan FIFO Status                                   */
  __IM  uint32_t             SCANDATA;               /**< Scan Data                                          */
        uint32_t             RESERVED3[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED4[1U];     /**< Reserved for future use                            */
  __IOM uint32_t             SINGLE;                 /**< Single Queue Port Selection                        */
        uint32_t             RESERVED5[1U];     /**< Reserved for future use                            */
        IADC_SCANTABLE_TypeDef SCANTABLE[16U];    /**< SCANTABLE                                          */
        uint32_t             RESERVED6[4U];     /**< Reserved for future use                            */
        uint32_t             RESERVED7[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED8[963U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_SET;                 /**< Enable                                             */
  __IOM uint32_t             CTRL_SET;               /**< Control                                            */
  __IOM uint32_t             CMD_SET;                /**< Command                                            */
  __IOM uint32_t             TIMER_SET;              /**< Timer                                              */
  __IM  uint32_t             STATUS_SET;             /**< Status                                             */
  __IOM uint32_t             MASKREQ_SET;            /**< Mask Request                                       */
  __IM  uint32_t             STMASK_SET;             /**< Scan Table Mask                                    */
  __IOM uint32_t             CMPTHR_SET;             /**< Digital Window Comparator Threshold                */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable                                   */
  __IOM uint32_t             TRIGGER_SET;            /**< Trigger                                            */
        uint32_t             RESERVED9[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED10[5U];    /**< Reserved for future use                            */
        IADC_CFG_TypeDef     CFG_SET[2U];       /**< CFG                                                */
        uint32_t             RESERVED11[2U];    /**< Reserved for future use                            */
  __IOM uint32_t             SINGLEFIFOCFG_SET;      /**< Single FIFO Configuration                          */
  __IM  uint32_t             SINGLEFIFODATA_SET;     /**< Single FIFO DATA                                   */
  __IM  uint32_t             SINGLEFIFOSTAT_SET;     /**< Single FIFO Status                                 */
  __IM  uint32_t             SINGLEDATA_SET;         /**< Single Data                                        */
  __IOM uint32_t             SCANFIFOCFG_SET;        /**< Scan FIFO Configuration                            */
  __IM  uint32_t             SCANFIFODATA_SET;       /**< Scan FIFO Read Data                                */
  __IM  uint32_t             SCANFIFOSTAT_SET;       /**< Scan FIFO Status                                   */
  __IM  uint32_t             SCANDATA_SET;           /**< Scan Data                                          */
        uint32_t             RESERVED12[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED13[1U];    /**< Reserved for future use                            */
  __IOM uint32_t             SINGLE_SET;             /**< Single Queue Port Selection                        */
        uint32_t             RESERVED14[1U];    /**< Reserved for future use                            */
        IADC_SCANTABLE_TypeDef SCANTABLE_SET[16U];/**< SCANTABLE                                          */
        uint32_t             RESERVED15[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED16[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED17[963U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_CLR;                 /**< Enable                                             */
  __IOM uint32_t             CTRL_CLR;               /**< Control                                            */
  __IOM uint32_t             CMD_CLR;                /**< Command                                            */
  __IOM uint32_t             TIMER_CLR;              /**< Timer                                              */
  __IM  uint32_t             STATUS_CLR;             /**< Status                                             */
  __IOM uint32_t             MASKREQ_CLR;            /**< Mask Request                                       */
  __IM  uint32_t             STMASK_CLR;             /**< Scan Table Mask                                    */
  __IOM uint32_t             CMPTHR_CLR;             /**< Digital Window Comparator Threshold                */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable                                   */
  __IOM uint32_t             TRIGGER_CLR;            /**< Trigger                                            */
        uint32_t             RESERVED18[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED19[5U];    /**< Reserved for future use                            */
        IADC_CFG_TypeDef     CFG_CLR[2U];       /**< CFG                                                */
        uint32_t             RESERVED20[2U];    /**< Reserved for future use                            */
  __IOM uint32_t             SINGLEFIFOCFG_CLR;      /**< Single FIFO Configuration                          */
  __IM  uint32_t             SINGLEFIFODATA_CLR;     /**< Single FIFO DATA                                   */
  __IM  uint32_t             SINGLEFIFOSTAT_CLR;     /**< Single FIFO Status                                 */
  __IM  uint32_t             SINGLEDATA_CLR;         /**< Single Data                                        */
  __IOM uint32_t             SCANFIFOCFG_CLR;        /**< Scan FIFO Configuration                            */
  __IM  uint32_t             SCANFIFODATA_CLR;       /**< Scan FIFO Read Data                                */
  __IM  uint32_t             SCANFIFOSTAT_CLR;       /**< Scan FIFO Status                                   */
  __IM  uint32_t             SCANDATA_CLR;           /**< Scan Data                                          */
        uint32_t             RESERVED21[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED22[1U];    /**< Reserved for future use                            */
  __IOM uint32_t             SINGLE_CLR;             /**< Single Queue Port Selection                        */
        uint32_t             RESERVED23[1U];    /**< Reserved for future use                            */
        IADC_SCANTABLE_TypeDef SCANTABLE_CLR[16U];/**< SCANTABLE                                          */
        uint32_t             RESERVED24[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED25[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED26[963U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_TGL;                 /**< Enable                                             */
  __IOM uint32_t             CTRL_TGL;               /**< Control                                            */
  __IOM uint32_t             CMD_TGL;                /**< Command                                            */
  __IOM uint32_t             TIMER_TGL;              /**< Timer                                              */
  __IM  uint32_t             STATUS_TGL;             /**< Status                                             */
  __IOM uint32_t             MASKREQ_TGL;            /**< Mask Request                                       */
  __IM  uint32_t             STMASK_TGL;             /**< Scan Table Mask                                    */
  __IOM uint32_t             CMPTHR_TGL;             /**< Digital Window Comparator Threshold                */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flags                                    */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable                                   */
  __IOM uint32_t             TRIGGER_TGL;            /**< Trigger                                            */
        uint32_t             RESERVED27[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED28[5U];    /**< Reserved for future use                            */
        IADC_CFG_TypeDef     CFG_TGL[2U];       /**< CFG                                                */
        uint32_t             RESERVED29[2U];    /**< Reserved for future use                            */
  __IOM uint32_t             SINGLEFIFOCFG_TGL;      /**< Single FIFO Configuration                          */
  __IM  uint32_t             SINGLEFIFODATA_TGL;     /**< Single FIFO DATA                                   */
  __IM  uint32_t             SINGLEFIFOSTAT_TGL;     /**< Single FIFO Status                                 */
  __IM  uint32_t             SINGLEDATA_TGL;         /**< Single Data                                        */
  __IOM uint32_t             SCANFIFOCFG_TGL;        /**< Scan FIFO Configuration                            */
  __IM  uint32_t             SCANFIFODATA_TGL;       /**< Scan FIFO Read Data                                */
  __IM  uint32_t             SCANFIFOSTAT_TGL;       /**< Scan FIFO Status                                   */
  __IM  uint32_t             SCANDATA_TGL;           /**< Scan Data                                          */
        uint32_t             RESERVED30[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED31[1U];    /**< Reserved for future use                            */
  __IOM uint32_t             SINGLE_TGL;             /**< Single Queue Port Selection                        */
        uint32_t             RESERVED32[1U];    /**< Reserved for future use                            */
        IADC_SCANTABLE_TypeDef SCANTABLE_TGL[16U];/**< SCANTABLE                                          */
        uint32_t             RESERVED33[4U];    /**< Reserved for future use                            */
        uint32_t             RESERVED34[1U];         /**< Reserved for future use                            */
} IADC_TypeDef;
