SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_iadc.h
/* Bit fields for IADC TRIGGER */
#define _IADC_TRIGGER_RESETVALUE                0x00000000UL                            /**< Default value for IADC_TRIGGER              */
#define _IADC_TRIGGER_MASK                      0x00011717UL                            /**< Mask for IADC_TRIGGER                       */
#define _IADC_TRIGGER_SCANTRIGSEL_SHIFT         0                                       /**< Shift value for IADC_SCANTRIGSEL            */
#define _IADC_TRIGGER_SCANTRIGSEL_MASK          0x7UL                                   /**< Bit mask for IADC_SCANTRIGSEL               */
#define _IADC_TRIGGER_SCANTRIGSEL_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for IADC_TRIGGER               */
#define _IADC_TRIGGER_SCANTRIGSEL_IMMEDIATE     0x00000000UL                            /**< Mode IMMEDIATE for IADC_TRIGGER             */
#define _IADC_TRIGGER_SCANTRIGSEL_TIMER         0x00000001UL                            /**< Mode TIMER for IADC_TRIGGER                 */
#define _IADC_TRIGGER_SCANTRIGSEL_PRSCLKGRP     0x00000002UL                            /**< Mode PRSCLKGRP for IADC_TRIGGER             */
#define _IADC_TRIGGER_SCANTRIGSEL_PRSPOS        0x00000003UL                            /**< Mode PRSPOS for IADC_TRIGGER                */
#define _IADC_TRIGGER_SCANTRIGSEL_PRSNEG        0x00000004UL                            /**< Mode PRSNEG for IADC_TRIGGER                */
#define _IADC_TRIGGER_SCANTRIGSEL_LESENSE       0x00000005UL                            /**< Mode LESENSE for IADC_TRIGGER               */
#define IADC_TRIGGER_SCANTRIGSEL_DEFAULT        (_IADC_TRIGGER_SCANTRIGSEL_DEFAULT << 0) /**< Shifted mode DEFAULT for IADC_TRIGGER       */
#define IADC_TRIGGER_SCANTRIGSEL_IMMEDIATE      (_IADC_TRIGGER_SCANTRIGSEL_IMMEDIATE << 0) /**< Shifted mode IMMEDIATE for IADC_TRIGGER     */
#define IADC_TRIGGER_SCANTRIGSEL_TIMER          (_IADC_TRIGGER_SCANTRIGSEL_TIMER << 0)  /**< Shifted mode TIMER for IADC_TRIGGER         */
#define IADC_TRIGGER_SCANTRIGSEL_PRSCLKGRP      (_IADC_TRIGGER_SCANTRIGSEL_PRSCLKGRP << 0) /**< Shifted mode PRSCLKGRP for IADC_TRIGGER     */
#define IADC_TRIGGER_SCANTRIGSEL_PRSPOS         (_IADC_TRIGGER_SCANTRIGSEL_PRSPOS << 0) /**< Shifted mode PRSPOS for IADC_TRIGGER        */
#define IADC_TRIGGER_SCANTRIGSEL_PRSNEG         (_IADC_TRIGGER_SCANTRIGSEL_PRSNEG << 0) /**< Shifted mode PRSNEG for IADC_TRIGGER        */
#define IADC_TRIGGER_SCANTRIGSEL_LESENSE        (_IADC_TRIGGER_SCANTRIGSEL_LESENSE << 0) /**< Shifted mode LESENSE for IADC_TRIGGER       */
#define IADC_TRIGGER_SCANTRIGACTION             (0x1UL << 4)                            /**< Scan Trigger Action                         */
#define _IADC_TRIGGER_SCANTRIGACTION_SHIFT      4                                       /**< Shift value for IADC_SCANTRIGACTION         */
#define _IADC_TRIGGER_SCANTRIGACTION_MASK       0x10UL                                  /**< Bit mask for IADC_SCANTRIGACTION            */
#define _IADC_TRIGGER_SCANTRIGACTION_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for IADC_TRIGGER               */
#define _IADC_TRIGGER_SCANTRIGACTION_ONCE       0x00000000UL                            /**< Mode ONCE for IADC_TRIGGER                  */
#define _IADC_TRIGGER_SCANTRIGACTION_CONTINUOUS 0x00000001UL                            /**< Mode CONTINUOUS for IADC_TRIGGER            */
#define IADC_TRIGGER_SCANTRIGACTION_DEFAULT     (_IADC_TRIGGER_SCANTRIGACTION_DEFAULT << 4) /**< Shifted mode DEFAULT for IADC_TRIGGER       */
#define IADC_TRIGGER_SCANTRIGACTION_ONCE        (_IADC_TRIGGER_SCANTRIGACTION_ONCE << 4) /**< Shifted mode ONCE for IADC_TRIGGER          */
#define IADC_TRIGGER_SCANTRIGACTION_CONTINUOUS  (_IADC_TRIGGER_SCANTRIGACTION_CONTINUOUS << 4) /**< Shifted mode CONTINUOUS for IADC_TRIGGER    */
#define _IADC_TRIGGER_SINGLETRIGSEL_SHIFT       8                                       /**< Shift value for IADC_SINGLETRIGSEL          */
#define _IADC_TRIGGER_SINGLETRIGSEL_MASK        0x700UL                                 /**< Bit mask for IADC_SINGLETRIGSEL             */
#define _IADC_TRIGGER_SINGLETRIGSEL_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for IADC_TRIGGER               */
#define _IADC_TRIGGER_SINGLETRIGSEL_IMMEDIATE   0x00000000UL                            /**< Mode IMMEDIATE for IADC_TRIGGER             */
#define _IADC_TRIGGER_SINGLETRIGSEL_TIMER       0x00000001UL                            /**< Mode TIMER for IADC_TRIGGER                 */
#define _IADC_TRIGGER_SINGLETRIGSEL_PRSCLKGRP   0x00000002UL                            /**< Mode PRSCLKGRP for IADC_TRIGGER             */
#define _IADC_TRIGGER_SINGLETRIGSEL_PRSPOS      0x00000003UL                            /**< Mode PRSPOS for IADC_TRIGGER                */
#define _IADC_TRIGGER_SINGLETRIGSEL_PRSNEG      0x00000004UL                            /**< Mode PRSNEG for IADC_TRIGGER                */
#define IADC_TRIGGER_SINGLETRIGSEL_DEFAULT      (_IADC_TRIGGER_SINGLETRIGSEL_DEFAULT << 8) /**< Shifted mode DEFAULT for IADC_TRIGGER       */
#define IADC_TRIGGER_SINGLETRIGSEL_IMMEDIATE    (_IADC_TRIGGER_SINGLETRIGSEL_IMMEDIATE << 8) /**< Shifted mode IMMEDIATE for IADC_TRIGGER     */
#define IADC_TRIGGER_SINGLETRIGSEL_TIMER        (_IADC_TRIGGER_SINGLETRIGSEL_TIMER << 8) /**< Shifted mode TIMER for IADC_TRIGGER         */
#define IADC_TRIGGER_SINGLETRIGSEL_PRSCLKGRP    (_IADC_TRIGGER_SINGLETRIGSEL_PRSCLKGRP << 8) /**< Shifted mode PRSCLKGRP for IADC_TRIGGER     */
#define IADC_TRIGGER_SINGLETRIGSEL_PRSPOS       (_IADC_TRIGGER_SINGLETRIGSEL_PRSPOS << 8) /**< Shifted mode PRSPOS for IADC_TRIGGER        */
#define IADC_TRIGGER_SINGLETRIGSEL_PRSNEG       (_IADC_TRIGGER_SINGLETRIGSEL_PRSNEG << 8) /**< Shifted mode PRSNEG for IADC_TRIGGER        */
#define IADC_TRIGGER_SINGLETRIGACTION           (0x1UL << 12)                           /**< Single Trigger Action                       */
#define _IADC_TRIGGER_SINGLETRIGACTION_SHIFT    12                                      /**< Shift value for IADC_SINGLETRIGACTION       */
#define _IADC_TRIGGER_SINGLETRIGACTION_MASK     0x1000UL                                /**< Bit mask for IADC_SINGLETRIGACTION          */
#define _IADC_TRIGGER_SINGLETRIGACTION_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for IADC_TRIGGER               */
#define _IADC_TRIGGER_SINGLETRIGACTION_ONCE     0x00000000UL                            /**< Mode ONCE for IADC_TRIGGER                  */
#define _IADC_TRIGGER_SINGLETRIGACTION_CONTINUOUS 0x00000001UL                            /**< Mode CONTINUOUS for IADC_TRIGGER            */
#define IADC_TRIGGER_SINGLETRIGACTION_DEFAULT   (_IADC_TRIGGER_SINGLETRIGACTION_DEFAULT << 12) /**< Shifted mode DEFAULT for IADC_TRIGGER       */
#define IADC_TRIGGER_SINGLETRIGACTION_ONCE      (_IADC_TRIGGER_SINGLETRIGACTION_ONCE << 12) /**< Shifted mode ONCE for IADC_TRIGGER          */
#define IADC_TRIGGER_SINGLETRIGACTION_CONTINUOUS (_IADC_TRIGGER_SINGLETRIGACTION_CONTINUOUS << 12) /**< Shifted mode CONTINUOUS for IADC_TRIGGER    */
#define IADC_TRIGGER_SINGLETAILGATE             (0x1UL << 16)                           /**< Single Tailgate Enable                      */
#define _IADC_TRIGGER_SINGLETAILGATE_SHIFT      16                                      /**< Shift value for IADC_SINGLETAILGATE         */
#define _IADC_TRIGGER_SINGLETAILGATE_MASK       0x10000UL                               /**< Bit mask for IADC_SINGLETAILGATE            */
#define _IADC_TRIGGER_SINGLETAILGATE_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for IADC_TRIGGER               */
#define _IADC_TRIGGER_SINGLETAILGATE_TAILGATEOFF 0x00000000UL                            /**< Mode TAILGATEOFF for IADC_TRIGGER           */
#define _IADC_TRIGGER_SINGLETAILGATE_TAILGATEON 0x00000001UL                            /**< Mode TAILGATEON for IADC_TRIGGER            */
#define IADC_TRIGGER_SINGLETAILGATE_DEFAULT     (_IADC_TRIGGER_SINGLETAILGATE_DEFAULT << 16) /**< Shifted mode DEFAULT for IADC_TRIGGER       */
#define IADC_TRIGGER_SINGLETAILGATE_TAILGATEOFF (_IADC_TRIGGER_SINGLETAILGATE_TAILGATEOFF << 16) /**< Shifted mode TAILGATEOFF for IADC_TRIGGER   */
#define IADC_TRIGGER_SINGLETAILGATE_TAILGATEON  (_IADC_TRIGGER_SINGLETAILGATE_TAILGATEON << 16) /**< Shifted mode TAILGATEON for IADC_TRIGGER    */

/* Bit fields for IADC CFG */
#define _IADC_CFG_RESETVALUE                    0x00002060UL                            /**< Default value for IADC_CFG                  */
#define _IADC_CFG_MASK                          0x30E770FFUL                            /**< Mask for IADC_CFG                           */
#define _IADC_CFG_ADCMODE_SHIFT                 0                                       /**< Shift value for IADC_ADCMODE                */
#define _IADC_CFG_ADCMODE_MASK                  0x3UL                                   /**< Bit mask for IADC_ADCMODE                   */
#define _IADC_CFG_ADCMODE_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for IADC_CFG                   */
#define _IADC_CFG_ADCMODE_NORMAL                0x00000000UL                            /**< Mode NORMAL for IADC_CFG                    */
#define IADC_CFG_ADCMODE_DEFAULT                (_IADC_CFG_ADCMODE_DEFAULT << 0)        /**< Shifted mode DEFAULT for IADC_CFG           */
#define IADC_CFG_ADCMODE_NORMAL                 (_IADC_CFG_ADCMODE_NORMAL << 0)         /**< Shifted mode NORMAL for IADC_CFG            */
#define _IADC_CFG_OSRHS_SHIFT                   2                                       /**< Shift value for IADC_OSRHS                  */
#define _IADC_CFG_OSRHS_MASK                    0x1CUL                                  /**< Bit mask for IADC_OSRHS                     */
#define _IADC_CFG_OSRHS_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for IADC_CFG                   */
#define _IADC_CFG_OSRHS_HISPD2                  0x00000000UL                            /**< Mode HISPD2 for IADC_CFG                    */
#define _IADC_CFG_OSRHS_HISPD4                  0x00000001UL                            /**< Mode HISPD4 for IADC_CFG                    */
#define _IADC_CFG_OSRHS_HISPD8                  0x00000002UL                            /**< Mode HISPD8 for IADC_CFG                    */
#define _IADC_CFG_OSRHS_HISPD16                 0x00000003UL                            /**< Mode HISPD16 for IADC_CFG                   */
#define _IADC_CFG_OSRHS_HISPD32                 0x00000004UL                            /**< Mode HISPD32 for IADC_CFG                   */
#define _IADC_CFG_OSRHS_HISPD64                 0x00000005UL                            /**< Mode HISPD64 for IADC_CFG                   */
#define IADC_CFG_OSRHS_DEFAULT                  (_IADC_CFG_OSRHS_DEFAULT << 2)          /**< Shifted mode DEFAULT for IADC_CFG           */
#define IADC_CFG_OSRHS_HISPD2                   (_IADC_CFG_OSRHS_HISPD2 << 2)           /**< Shifted mode HISPD2 for IADC_CFG            */
#define IADC_CFG_OSRHS_HISPD4                   (_IADC_CFG_OSRHS_HISPD4 << 2)           /**< Shifted mode HISPD4 for IADC_CFG            */
#define IADC_CFG_OSRHS_HISPD8                   (_IADC_CFG_OSRHS_HISPD8 << 2)           /**< Shifted mode HISPD8 for IADC_CFG            */
#define IADC_CFG_OSRHS_HISPD16                  (_IADC_CFG_OSRHS_HISPD16 << 2)          /**< Shifted mode HISPD16 for IADC_CFG           */
#define IADC_CFG_OSRHS_HISPD32                  (_IADC_CFG_OSRHS_HISPD32 << 2)          /**< Shifted mode HISPD32 for IADC_CFG           */
#define IADC_CFG_OSRHS_HISPD64                  (_IADC_CFG_OSRHS_HISPD64 << 2)          /**< Shifted mode HISPD64 for IADC_CFG           */
#define _IADC_CFG_ANALOGGAIN_SHIFT              12                                      /**< Shift value for IADC_ANALOGGAIN             */
#define _IADC_CFG_ANALOGGAIN_MASK               0x7000UL                                /**< Bit mask for IADC_ANALOGGAIN                */
#define _IADC_CFG_ANALOGGAIN_DEFAULT            0x00000002UL                            /**< Mode DEFAULT for IADC_CFG                   */
#define _IADC_CFG_ANALOGGAIN_ANAGAIN0P5         0x00000001UL                            /**< Mode ANAGAIN0P5 for IADC_CFG                */
#define _IADC_CFG_ANALOGGAIN_ANAGAIN1           0x00000002UL                            /**< Mode ANAGAIN1 for IADC_CFG                  */
#define _IADC_CFG_ANALOGGAIN_ANAGAIN2           0x00000003UL                            /**< Mode ANAGAIN2 for IADC_CFG                  */
#define _IADC_CFG_ANALOGGAIN_ANAGAIN3           0x00000004UL                            /**< Mode ANAGAIN3 for IADC_CFG                  */
#define _IADC_CFG_ANALOGGAIN_ANAGAIN4           0x00000005UL                            /**< Mode ANAGAIN4 for IADC_CFG                  */
#define IADC_CFG_ANALOGGAIN_DEFAULT             (_IADC_CFG_ANALOGGAIN_DEFAULT << 12)    /**< Shifted mode DEFAULT for IADC_CFG           */
#define IADC_CFG_ANALOGGAIN_ANAGAIN0P5          (_IADC_CFG_ANALOGGAIN_ANAGAIN0P5 << 12) /**< Shifted mode ANAGAIN0P5 for IADC_CFG        */
#define IADC_CFG_ANALOGGAIN_ANAGAIN1            (_IADC_CFG_ANALOGGAIN_ANAGAIN1 << 12)   /**< Shifted mode ANAGAIN1 for IADC_CFG          */
#define IADC_CFG_ANALOGGAIN_ANAGAIN2            (_IADC_CFG_ANALOGGAIN_ANAGAIN2 << 12)   /**< Shifted mode ANAGAIN2 for IADC_CFG          */
#define IADC_CFG_ANALOGGAIN_ANAGAIN3            (_IADC_CFG_ANALOGGAIN_ANAGAIN3 << 12)   /**< Shifted mode ANAGAIN3 for IADC_CFG          */
#define IADC_CFG_ANALOGGAIN_ANAGAIN4            (_IADC_CFG_ANALOGGAIN_ANAGAIN4 << 12)   /**< Shifted mode ANAGAIN4 for IADC_CFG          */
#define _IADC_CFG_REFSEL_SHIFT                  16                                      /**< Shift value for IADC_REFSEL                 */
#define _IADC_CFG_REFSEL_MASK                   0x70000UL                               /**< Bit mask for IADC_REFSEL                    */
#define _IADC_CFG_REFSEL_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for IADC_CFG                   */
#define _IADC_CFG_REFSEL_VBGR                   0x00000000UL                            /**< Mode VBGR for IADC_CFG                      */
#define _IADC_CFG_REFSEL_VREF                   0x00000001UL                            /**< Mode VREF for IADC_CFG                      */
#define _IADC_CFG_REFSEL_VDDX                   0x00000003UL                            /**< Mode VDDX for IADC_CFG                      */
#define _IADC_CFG_REFSEL_VDDX0P8BUF             0x00000004UL                            /**< Mode VDDX0P8BUF for IADC_CFG                */
#define IADC_CFG_REFSEL_DEFAULT                 (_IADC_CFG_REFSEL_DEFAULT << 16)        /**< Shifted mode DEFAULT for IADC_CFG           */
#define IADC_CFG_REFSEL_VBGR                    (_IADC_CFG_REFSEL_VBGR << 16)           /**< Shifted mode VBGR for IADC_CFG              */
#define IADC_CFG_REFSEL_VREF                    (_IADC_CFG_REFSEL_VREF << 16)           /**< Shifted mode VREF for IADC_CFG              */
#define IADC_CFG_REFSEL_VDDX                    (_IADC_CFG_REFSEL_VDDX << 16)           /**< Shifted mode VDDX for IADC_CFG              */
#define IADC_CFG_REFSEL_VDDX0P8BUF              (_IADC_CFG_REFSEL_VDDX0P8BUF << 16)     /**< Shifted mode VDDX0P8BUF for IADC_CFG        */
#define _IADC_CFG_DIGAVG_SHIFT                  21                                      /**< Shift value for IADC_DIGAVG                 */
#define _IADC_CFG_DIGAVG_MASK                   0xE00000UL                              /**< Bit mask for IADC_DIGAVG                    */
#define _IADC_CFG_DIGAVG_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for IADC_CFG                   */
#define _IADC_CFG_DIGAVG_AVG1                   0x00000000UL                            /**< Mode AVG1 for IADC_CFG                      */
#define _IADC_CFG_DIGAVG_AVG2                   0x00000001UL                            /**< Mode AVG2 for IADC_CFG                      */
#define _IADC_CFG_DIGAVG_AVG4                   0x00000002UL                            /**< Mode AVG4 for IADC_CFG                      */
#define _IADC_CFG_DIGAVG_AVG8                   0x00000003UL                            /**< Mode AVG8 for IADC_CFG                      */
#define _IADC_CFG_DIGAVG_AVG16                  0x00000004UL                            /**< Mode AVG16 for IADC_CFG                     */
#define IADC_CFG_DIGAVG_DEFAULT                 (_IADC_CFG_DIGAVG_DEFAULT << 21)        /**< Shifted mode DEFAULT for IADC_CFG           */
#define IADC_CFG_DIGAVG_AVG1                    (_IADC_CFG_DIGAVG_AVG1 << 21)           /**< Shifted mode AVG1 for IADC_CFG              */
#define IADC_CFG_DIGAVG_AVG2                    (_IADC_CFG_DIGAVG_AVG2 << 21)           /**< Shifted mode AVG2 for IADC_CFG              */
#define IADC_CFG_DIGAVG_AVG4                    (_IADC_CFG_DIGAVG_AVG4 << 21)           /**< Shifted mode AVG4 for IADC_CFG              */
#define IADC_CFG_DIGAVG_AVG8                    (_IADC_CFG_DIGAVG_AVG8 << 21)           /**< Shifted mode AVG8 for IADC_CFG              */
#define IADC_CFG_DIGAVG_AVG16                   (_IADC_CFG_DIGAVG_AVG16 << 21)          /**< Shifted mode AVG16 for IADC_CFG             */
#define _IADC_CFG_TWOSCOMPL_SHIFT               28                                      /**< Shift value for IADC_TWOSCOMPL              */
#define _IADC_CFG_TWOSCOMPL_MASK                0x30000000UL                            /**< Bit mask for IADC_TWOSCOMPL                 */
#define _IADC_CFG_TWOSCOMPL_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for IADC_CFG                   */
#define _IADC_CFG_TWOSCOMPL_AUTO                0x00000000UL                            /**< Mode AUTO for IADC_CFG                      */
#define _IADC_CFG_TWOSCOMPL_FORCEUNIPOLAR       0x00000001UL                            /**< Mode FORCEUNIPOLAR for IADC_CFG             */
#define _IADC_CFG_TWOSCOMPL_FORCEBIPOLAR        0x00000002UL                            /**< Mode FORCEBIPOLAR for IADC_CFG              */
#define IADC_CFG_TWOSCOMPL_DEFAULT              (_IADC_CFG_TWOSCOMPL_DEFAULT << 28)     /**< Shifted mode DEFAULT for IADC_CFG           */
#define IADC_CFG_TWOSCOMPL_AUTO                 (_IADC_CFG_TWOSCOMPL_AUTO << 28)        /**< Shifted mode AUTO for IADC_CFG              */
#define IADC_CFG_TWOSCOMPL_FORCEUNIPOLAR        (_IADC_CFG_TWOSCOMPL_FORCEUNIPOLAR << 28) /**< Shifted mode FORCEUNIPOLAR for IADC_CFG     */
#define IADC_CFG_TWOSCOMPL_FORCEBIPOLAR         (_IADC_CFG_TWOSCOMPL_FORCEBIPOLAR << 28) /**< Shifted mode FORCEBIPOLAR for IADC_CFG      */

/* Bit fields for IADC SCALE */
#define _IADC_SCALE_RESETVALUE                  0x8002C000UL                            /**< Default value for IADC_SCALE                */
#define _IADC_SCALE_MASK                        0xFFFFFFFFUL                            /**< Mask for IADC_SCALE                         */
#define _IADC_SCALE_OFFSET_SHIFT                0                                       /**< Shift value for IADC_OFFSET                 */
#define _IADC_SCALE_OFFSET_MASK                 0x3FFFFUL                               /**< Bit mask for IADC_OFFSET                    */
#define _IADC_SCALE_OFFSET_DEFAULT              0x0002C000UL                            /**< Mode DEFAULT for IADC_SCALE                 */
#define IADC_SCALE_OFFSET_DEFAULT               (_IADC_SCALE_OFFSET_DEFAULT << 0)       /**< Shifted mode DEFAULT for IADC_SCALE         */
#define _IADC_SCALE_GAIN13LSB_SHIFT             18                                      /**< Shift value for IADC_GAIN13LSB              */
#define _IADC_SCALE_GAIN13LSB_MASK              0x7FFC0000UL                            /**< Bit mask for IADC_GAIN13LSB                 */
#define _IADC_SCALE_GAIN13LSB_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for IADC_SCALE                 */
#define IADC_SCALE_GAIN13LSB_DEFAULT            (_IADC_SCALE_GAIN13LSB_DEFAULT << 18)   /**< Shifted mode DEFAULT for IADC_SCALE         */
#define IADC_SCALE_GAIN3MSB                     (0x1UL << 31)                           /**< Gain 3 MSBs                                 */
#define _IADC_SCALE_GAIN3MSB_SHIFT              31                                      /**< Shift value for IADC_GAIN3MSB               */
#define _IADC_SCALE_GAIN3MSB_MASK               0x80000000UL                            /**< Bit mask for IADC_GAIN3MSB                  */
#define _IADC_SCALE_GAIN3MSB_DEFAULT            0x00000001UL                            /**< Mode DEFAULT for IADC_SCALE                 */
#define _IADC_SCALE_GAIN3MSB_GAIN011            0x00000000UL                            /**< Mode GAIN011 for IADC_SCALE                 */
#define _IADC_SCALE_GAIN3MSB_GAIN100            0x00000001UL                            /**< Mode GAIN100 for IADC_SCALE                 */
#define IADC_SCALE_GAIN3MSB_DEFAULT             (_IADC_SCALE_GAIN3MSB_DEFAULT << 31)    /**< Shifted mode DEFAULT for IADC_SCALE         */
#define IADC_SCALE_GAIN3MSB_GAIN011             (_IADC_SCALE_GAIN3MSB_GAIN011 << 31)    /**< Shifted mode GAIN011 for IADC_SCALE         */
#define IADC_SCALE_GAIN3MSB_GAIN100             (_IADC_SCALE_GAIN3MSB_GAIN100 << 31)    /**< Shifted mode GAIN100 for IADC_SCALE         */

/* Bit fields for IADC SCHED */
#define _IADC_SCHED_RESETVALUE                  0x00000000UL                            /**< Default value for IADC_SCHED                */
#define _IADC_SCHED_MASK                        0x000003FFUL                            /**< Mask for IADC_SCHED                         */
#define _IADC_SCHED_PRESCALE_SHIFT              0                                       /**< Shift value for IADC_PRESCALE               */
#define _IADC_SCHED_PRESCALE_MASK               0x3FFUL                                 /**< Bit mask for IADC_PRESCALE                  */
#define _IADC_SCHED_PRESCALE_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for IADC_SCHED                 */
#define IADC_SCHED_PRESCALE_DEFAULT             (_IADC_SCHED_PRESCALE_DEFAULT << 0)     /**< Shifted mode DEFAULT for IADC_SCHED         */

